In [1]:
import numpy as np
import pandas as pd

##### 文本文件讀取：

In [2]:
order = pd.read_csv('meal_order_info.csv', encoding="gbk", sep=",")

##### 通用文本文件讀取方法：

In [3]:
order = pd.read_table(r'meal_order_info.csv', encoding="gbk", sep=",")

##### Excel文件讀取 。xls，xlsx兩種後綴都可以：

In [4]:
detail = pd.read_excel('meal_order_detail.xlsx', sheet_name = None) # sheet_name = None 表示返回所有表
detail.keys() # 仿照字典查看所有的表

dict_keys(['meal_order_detail1', 'meal_order_detail2', 'meal_order_detail3'])

##### 獲取每一張表的內容

In [5]:
detail['meal_order_detail1']

,detail_id,order_id,dishes_id,logicprn_name,parent_class_name,dishes_name,itemis_add,counts,amounts,cost,place_order_time,discount_amt,discount_reason,kick_back,add_inprice,add_info,bar_code,picture_file,emp_id
0,2956,417,610062,NaN,NaN,蒜蓉生蚝,0,1,49,NaN,2016-08-01 11:05:36,NaN,NaN,NaN,0,NaN,NaN,caipu/104001.jpg,1442
1,2958,417,609957,NaN,NaN,蒙古烤羊腿,0,1,48,NaN,2016-08-01 11:07:07,NaN,NaN,NaN,0,NaN,NaN,caipu/202003.jpg,1442
2,2961,417,609950,NaN,NaN,大蒜苋菜,0,1,30,NaN,2016-08-01 11:07:40,NaN,NaN,NaN,0,NaN,NaN,caipu/303001.jpg,1442
3,2966,417,610038,NaN,NaN,芝麻烤紫菜,0,1,25,NaN,2016-08-01 11:11:11,NaN,NaN,NaN,0,NaN,NaN,caipu/105002.jpg,1442
4,2968,417,610003,NaN,NaN,蒜香包,0,1,13,NaN,2016-08-01 11:11:30,NaN,NaN,NaN,0,NaN,NaN,caipu/503002.jpg,1442
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
2774,6750,774,610011,NaN,NaN,白饭/大碗,0,1,10,NaN,2016-08-10 21:56:24,NaN,NaN,NaN,0,NaN,NaN,caipu/601005.jpg,1138
2775,6742,774,609996,NaN,NaN,牛尾汤,0,1,40,NaN,2016-08-10 21:56:48,NaN,NaN,NaN,0,NaN,NaN,caipu/201006.jpg,1138
2776,6756,774,609949,NaN,NaN,意文柠檬汁,0,1,13,NaN,2016-08-10 22:01:52,NaN,NaN,NaN,0,NaN,NaN,caipu/404005.jpg,1138
2777,6763,774,610014,NaN,NaN,金玉良缘,0,1,30,NaN,2016-08-10 22:03:58,NaN,NaN,NaN,0,NaN,NaN,caipu/302003.jpg,1138
2778,6764,774,610017,NaN,NaN,酸辣藕丁,0,1,33,NaN,2016-08-10 22:04:30,NaN,NaN,NaN,0,NaN,NaN,caipu/302006.jpg,1138

##### header 表示將第 3 行作為列索引， skiprow 表示忽略第  1 ，2 行

In [6]:
detail = pd.read_excel('meal_order_detail.xlsx', sheet_name = 0, header = 2, skiprows = [0, 1])

In [7]:
detail

,2966,417,610038,NA,NA.1,芝麻烤紫菜,0,1,25,NA.2,2016-08-01 11:11:11,NA.3,NA.4,NA.5,0.1,NA.6,NA.7,caipu/105002.jpg,1442
0,2968,417,610003,NaN,NaN,蒜香包,0,1,13,NaN,2016-08-01 11:11:30,NaN,NaN,NaN,0,NaN,NaN,caipu/503002.jpg,1442
1,1899,301,610019,NaN,NaN,白斩鸡,0,1,88,NaN,2016-08-01 11:15:57,NaN,NaN,NaN,0,NaN,NaN,caipu/204002.jpg,1095
2,1902,301,609991,NaN,NaN,香烤牛排,0,1,55,NaN,2016-08-01 11:19:12,NaN,NaN,NaN,0,NaN,NaN,caipu/201001.jpg,1095
3,1906,301,609983,NaN,NaN,干锅田鸡,0,1,88,NaN,2016-08-01 11:22:21,NaN,NaN,NaN,0,NaN,NaN,caipu/205003.jpg,1095
4,1907,301,609981,NaN,NaN,桂圆枸杞鸽子汤,0,1,48,NaN,2016-08-01 11:22:53,NaN,NaN,NaN,0,NaN,NaN,caipu/205001.jpg,1095
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
2770,6750,774,610011,NaN,NaN,白饭/大碗,0,1,10,NaN,2016-08-10 21:56:24,NaN,NaN,NaN,0,NaN,NaN,caipu/601005.jpg,1138
2771,6742,774,609996,NaN,NaN,牛尾汤,0,1,40,NaN,2016-08-10 21:56:48,NaN,NaN,NaN,0,NaN,NaN,caipu/201006.jpg,1138
2772,6756,774,609949,NaN,NaN,意文柠檬汁,0,1,13,NaN,2016-08-10 22:01:52,NaN,NaN,NaN,0,NaN,NaN,caipu/404005.jpg,1138
2773,6763,774,610014,NaN,NaN,金玉良缘,0,1,30,NaN,2016-08-10 22:03:58,NaN,NaN,NaN,0,NaN,NaN,caipu/302003.jpg,1138
2774,6764,774,610017,NaN,NaN,酸辣藕丁,0,1,33,NaN,2016-08-10 22:04:30,NaN,NaN,NaN,0,NaN,NaN,caipu/302006.jpg,1138

##### DataFrame的查詢：

In [8]:
columns = ['Name', 'Age', 'Class', 'PhoneNum', 'IDNum']
data = [['Mary', 20, 1401, '18734444', 1], ['Oz', 21, 1401, '18734445', 2],['Jerry', 20, 1401, '18767442', 3]]
df = pd.DataFrame(columns = columns, data = data)
df

    Name  Age  Class  PhoneNum  IDNum
0   Mary   20   1401  18734444      1
1     Oz   21   1401  18734445      2
2  Jerry   20   1401  18767442      3

##### 基本切片：

In [9]:
df['Name'] #返回一個Series類型。

0     Mary
1       Oz
2    Jerry
Name: Name, dtype: object

In [10]:
df[['Name']] # 返回一個DataFrame類型

    Name
0   Mary
1     Oz
2  Jerry

In [11]:
df[['Name', 'Age']] #多列切片

    Name  Age
0   Mary   20
1     Oz   21
2  Jerry   20

In [12]:
df[['Name', 'Age']][:2] #先切列再切行，返回姓名和年齡列的前兩行

   Name  Age
0  Mary   20
1    Oz   21

##### 靈活切片： loc / iloc

In [13]:
df.loc[:1, ['Name', 'Age']] #前面表示0到1行（包含1），後面表示切姓名和年齡列。

   Name  Age
0  Mary   20
1    Oz   21

In [14]:
df.iloc[:2, [0, 1]] # 前面0到1行，不包含2，後面返回第0，1列。

   Name  Age
0  Mary   20
1    Oz   21

In [15]:
df.loc[df['Age'] < 21, ['Name','PhoneNum']] #返回年齡小於21歲的人的姓名

    Name  PhoneNum
0   Mary  18734444
2  Jerry  18767442

##### Mask 切片

In [16]:
mask = df['Age'] < 21 #返回一個Bool的series
mask

0     True
1    False
2     True
Name: Age, dtype: bool

In [17]:
df.loc[mask,['Name', 'Age']]

    Name  Age
0   Mary   20
2  Jerry   20

##### 更改數據：

In [18]:
df.loc[df['Name'] == 'Mary', 'Age'] = 22 # 直接修改了數據
df

    Name  Age  Class  PhoneNum  IDNum
0   Mary   22   1401  18734444      1
1     Oz   21   1401  18734445      2
2  Jerry   20   1401  18767442      3

##### 增添數據：

In [19]:
df['Gender'] = pd.Series(['F', 'M', 'M']) 直接添加了一列
df

    Name  Age  Class  PhoneNum  IDNum Gender
0   Mary   22   1401  18734444      1      F
1     Oz   21   1401  18734445      2      M
2  Jerry   20   1401  18767442      3      M

In [25]:
df.loc[3] = ['Olivia', 19, 1402, '16098232', 4, 'F'] #也可以用loc 直接添加行

In [26]:
df

     Name  Age  Class  PhoneNum  IDNum Gender
0    Mary   22   1401  18734444      1      F
1      Oz   21   1401  18734445      2      M
2   Jerry   20   1401  18767442      3      M
3  Olivia   19   1402  16098232      4      F

##### 刪除行和列

In [27]:
df.drop(labels = 'PhoneNum', axis = 1) # 1表示對列的刪除

     Name  Age  Class  IDNum Gender
0    Mary   22   1401      1      F
1      Oz   21   1401      2      M
2   Jerry   20   1401      3      M
3  Olivia   19   1402      4      F

In [28]:
df.drop(labels = 0, axis = 0) #0 表示對行的刪除

     Name  Age  Class  PhoneNum  IDNum Gender
1      Oz   21   1401  18734445      2      M
2   Jerry   20   1401  18767442      3      M
3  Olivia   19   1402  16098232      4      F

#### 原來的DataFrame 並沒有被修改，如想要修改添加 inplace = Ture 參數來修改原數據表

In [29]:
df

     Name  Age  Class  PhoneNum  IDNum Gender
0    Mary   22   1401  18734444      1      F
1      Oz   21   1401  18734445      2      M
2   Jerry   20   1401  18767442      3      M
3  Olivia   19   1402  16098232      4      F

### <font color = "red"> 統計分析方法： </font>

##### 1. 用Numpy的部分方法：

In [30]:
np.mean(df['Age']) #求年齡的平均值

20.5